//------------------------------------------------------------------------
// NAME: Mariyan Bitsov
// CLASS: XIa
// NUMBER: 17
// PROBLEM: #1
// FILE NAME: mystrlen.c (unix file name)
// FILE PURPOSE:
// Програма, която показва дължината на символен низ. 
//------------------------------------------------------------------------

#include <stdio.h>
#include <stdlib.h>

//инициализиране на функцията 
size_t strlen(const char*);

int main(){
    char str[255] = "Batman";

    //извикване на функцията и принтиране на резултата
    printf("%ld\n", strlen(str));
    
    return 0;
}

size_t strlen(const char* str){
    int len = 0;
    //броене до края на символния низ (или терминираща '\0') 
    for(int i = 0; str[i] != '\0'; i++){
        len++;
    }

    return len;    
}

//------------------------------------------------------------------------
// FUNCTION: strlen (име на функцията)
// връща дължината на стринга в тип(int)
// PARAMETERS:
// const char* string : константен указател към масив от тип (char) 
//------------------------------------------------------------------------