//------------------------------------------------------------------------
// NAME: Mariyan Bitsov
// CLASS: XIa
// NUMBER: 17
// PROBLEM: #1
// FILE NAME: mystrdup.c (unix file name)
// FILE PURPOSE:
// Програма, която дублира символен низ. 
//-----------------------------------------------------------------------

#include <stdio.h>
#include <stdlib.h>

//инициализация на функцията strdup() от тип (char*)
char *strdup(const char*);

int main(){
	char str[100] = "Hello World!";

	printf("%s\n", strdup(str)); //извикване на функцията и принтиране на символния низ

	return 0;
}

char *strdup(const char* str){
	char *new; //създава се нова променлива от тип (char*)
	int len; //инициализация на променлива, която ще служи да запази големината на символния низ
	for(int i = 0; str[i] != '\0'; i++){
		len++;	//повдигане с 1 на всяка итерация, докато не стигне края на символния низ (терминираща '\0')
	}

	new = (char*)malloc(len + 1 * sizeof(char)); //заделяне на памет за символен низ от тип (char*) -> размера на низа + 1
	// за да може и да се остави място за терминиращата '\0'
	for(int i = 0; str[i] != '\0'; i++){
		new[i] = str[i];	//добавяне на всеки елемент към вече новозаделеният символен низ от стария
	}

	return new; //връщане на новия, дублиран, динамичен символен низ
}

//------------------------------------------------------------------------
// FUNCTION: strdup (име на функцията)
// дублира стринга в нов, динамичен и го връща като тип(char*)
// PARAMETERS:
// const char* str : константен указател към масив от тип(char*) 
//------------------------------------------------------------------------