//------------------------------------------------------------------------
// NAME: Mariyan Bitsov
// CLASS: XIa
// NUMBER: 17
// PROBLEM: #1
// FILE NAME: void-swap.c (unix file name)
// FILE PURPOSE:
// Програма, която сменя стойностите на две променливи. 
//------------------------------------------------------------------------

#include <stdio.h>
#include <stdlib.h>

//инициализация на функцията swap()
void swap(void*, void*, size_t);

int main(){

	char a = 't'; //инициализиране на променливите от тип (char)
	char b = 'z';

	void *pa = &a;	//създаване на оказатели от тип (void), който може да се каства към всеки тип.
	void *pb = &b;

	swap(pa, pb, sizeof(char)); // извикване на функцията

	printf("a = %c, b = %c \n", a, b); //принтиране на променливите

	return 0;
}

void swap(void *a, void *b, size_t size){
	unsigned char *ta = a, *tb = b, temp; //създаване на два нови оказателя от тип (unsigned char) 
	for (size_t i = 0; i != size; i++){ //взима размера на i операнта в байтове в паметта и цикли докато не стане равно
		temp = ta[i]; 					//на размера на size, който сме подали при извикването на функцията в този случай големината на (char)
		ta[i] = tb[i];	
		tb[i] = temp;		//имплементиране на проста размяна между елементите, но тук за всеки байт
	}
}

//------------------------------------------------------------------------
// FUNCTION: swap (име на функцията)
// разменя стойностите на две променливи
// PARAMETERS:
// void a*: указател от тип (void*) можещ да бъде кастван към всеки тип
// void b*: указател от тип (void*) можещ да бъде кастван към всеки тип
// size_t size: променлива която съдържа в себе си размера на променливата в битове
//------------------------------------------------------------------------